x=[0 1 1 4 7 7 8 8 7 4 1 0 0;
   0 0 6 0 6 0 0 8 8 2 8 8 0;
   1 1 1 1 1 1 1 1 1 1 1 1 1];

for h=0.1:0.01:3
    % 크기를 h배로 변환.
    % h는 0.1~3까지 0.01 간격으로 커짐.
    % M 서서히 확대.
    A=[h 0 0; 0 h 0; 0 0 1];
    y=A*x;
    clf;
    axis([0 30 0 30]);
    line(y(1,:), y(2,:));
    grid on;
    text(20, 6, '202500062 / 이서진')
    pause(0.001);
end

for h=3:-0.01:0.01
    % 크기를 h배로 변환.
    % h는 3~0.1까지 0.01 간격으로 작아짐.
    % M 서서히 축소.
    A=[h 0 0; 0 h 0; 0 0 1];
    y=A*x;
    clf;
    axis([0 30 0 30]);
    line(y(1,:), y(2,:));
    grid on;
    text(20, 6, '202500062 / 이서진')
    pause(0.001);
end